run/rockerPlate/trimmedSoilbox/0/pE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    seaBed
    {
        type            fixedValue;
        value           uniform 0;
    }

    rockerTop
    {
        type            fixedValue;
        value           uniform 0;
        //type            zeroGradient;
    }

    rocker
    {
        type            fixedValue;
        value           uniform 0;
        //type            zeroGradient;
    }

    left
    {
        type            zeroGradient;
    }

    right
    {
        type            zeroGradient;
    }

    left1
    {
        type            zeroGradient;  
    }

    right1
    {
        type            zeroGradient;  
    }


    left2
    {
        type             fixedValue;
        value           uniform 0; 
    }

    
    right2
    {
        type            fixedValue;
        value           uniform 0; 
    }

    soilDomainBottom
    {
        type            zeroGradient;
    }

    frontBack
    {
        type            empty;
    }

}

// ************************************************************************* //
