run/rockerPlate/trimmedSoilbox/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          probesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//type probes;
// Fields to be probed. runTime modifiable!
fields
(
    //liqueCriteria
    p
    //pE
    tauXZ
    //tauXZPrime2mean
    //U
    );

// Locations to be probed. runTime modifiable!
probeLocations
(
/*(0.225 0  -0.052)
(0.225 0  -0.072)
(0.225 0  -0.121)
(0.225 0  -0.165)
(0.308 0  -0.025)
(0.363 0  -0.025)
(0.408 0  -0.025)
(0.45  0  -0.055)
(0.45  0  -0.075)
(0.45  0  -0.165)
(0.59  0  -0.0165)
(0.59  0  -0.158)
(0.59  0  -0.0145)
(0.5985  0.01  -0.0149)
(0.5985  0.01  -0.0151)*/


(0.3015 0  -0.05)
(0.3750 0  -0.05)
(0.45 0  -0.05)
(0.5500 0  -0.05)
(0.5985 0  -0.05)
);


// ************************************************************************* //
